
# ОБЩИЙ ТЕКСТ! --------------------------------------------------------------
# Текст приветствия.
hello_text = '<b>Здравствуйте, </b>'
# Текст действия расчета антибиотиков.
lets_calculate_text = '<b>, давайте назначим антибиотики</b>'

# ТЕКСТ СООБЩЕНИЙ! -----------------------------------------------------------
# Текст факторов риска после рождения.
risc_factors = (f'<b><em><u>Факторы риска после рождения:</u></em></b>\n'
                f'<b>1. Лейкопения менее 5 тыс. в 1 с.ж.</b>\n'
                f'<b>2. Лейкоцитоз более 35 тыс. в 1 с.ж.</b>\n'
                f'<b>3. Смещение Le формулы влево (НИ более 0.2).</b>\n'
                f'<b>4. Метаболический лактат-ацидоз, необъяснимый асфиксией \n'
                f'или респираторными нарушениями.</b>\n'
                f'<b>5. Уровень СРБ более 10 мг/л.</b>\n'
                f'<b>6. Катетеризация центральной вены.</b>\n'
                f'<b>7. Характерные рентгенологические признаки.</b>\n'
                )
# Текст для выбора варианта.
variant_choose_comment = f'<b>Выберете вариант:</b>'

# СООБЩЕНИЯ ДЛЯ АНТИБИОТИКОВ! ---------------------------------------------------
# Сообщение для Сультасина.
sultasini_message = f'<b>Каждые 12 часов за 30 минут</b>'

# ТЕКСТЫ КНОПОК. -------------------------------------------------------------
# Текст перезапуска.
button_restart_text = f'Начнем сначала!'
# Новорожденные с ДН без факторов.
button_newborn_respiratory_no_risk = 'Новорожденные с ДН без факторов.'
# НР без КС, но с условными ФР.
button_newborn_no_clinic_conditional = 'Новорожденные без клинических симптомов, но с условными факторами риска.'
# НР без КС, но с абсолютными ФР.
button_newborn_no_clinic_absolute = 'Новорожденные без клинических симптомов, но с абсолютными факторами риска.'
# При ДН более 2-х факторов риска.
button_more_than_two_risc_factors_rds = 'Более 2-х факторов риска'
# При ДН менее 2-х факторов риска.
button_less_than_two_risc_factors_rds = 'Менее 2-х факторов риска'

